In [22]:
import pandas as pd
import numpy as np

In [4]:
data = pd.Series([0.23, 0.5, 0.5, 0.6])

In [6]:
data

0    0.23
1    0.50
2    0.50
3    0.60
dtype: float64

In [14]:
data.values
data.index
data[1]
data[1:3]

1    0.5
2    0.5
dtype: float64

In [20]:
df = pd.DataFrame({'col one': [100, 200], 'col two': [300, 400]})
df1 = pd.DataFrame({'city': ['kathmandu', 'bhaktapur'], 'river': ['trisuli', 'bisnumati']})
print(df)
print(df1)

   col one  col two
0      100      300
1      200      400
        city      river
0  kathmandu    trisuli
1  bhaktapur  bisnumati

In [24]:
#creating random dataframe with random values we use numpy random.rand
pd.DataFrame(np.random.rand(4,8))

,0,1,2,3,4,5,6,7
0,0.104407,0.604312,0.571119,0.944492,0.736736,0.711318,0.337767,0.106207
1,0.005234,0.111685,0.891602,0.399998,0.978249,0.702306,0.223249,0.429306
2,0.038707,0.758495,0.838099,0.182684,0.775569,0.221968,0.863874,0.304133
3,0.486984,0.043290,0.637394,0.318430,0.002375,0.027187,0.588964,0.201871

In [28]:
pd.DataFrame(np.random.rand(5,6), columns=list('abcdef'))
#while writing the column names like this the number of characters should be equal to 
#the number of columns in the table

          a         b         c         d         e         f
0  0.004131  0.104055  0.284059  0.676227  0.105378  0.781323
1  0.057973  0.956846  0.817317  0.706585  0.963306  0.448859
2  0.407344  0.776999  0.657861  0.013448  0.818900  0.114145
3  0.583024  0.316140  0.454818  0.732223  0.306127  0.445017
4  0.652032  0.039925  0.089486  0.814548  0.881257  0.829910

In [30]:
df

   col one  col two
0      100      300
1      200      400

In [32]:
df.rename({'col one':'col_one', 'col two':'col_two'}, axis='columns')

   col_one  col_two
0      100      300
1      200      400

In [34]:
df.columns = ['col1', 'col2']
df

   col1  col2
0   100   300
1   200   400

In [36]:
df.columns = ['col one', 'col two']
df

   col one  col two
0      100      300
1      200      400

In [40]:
df.columns = df.columns.str.replace(' ', '_')
df

   col_one  col_two
0      100      300
1      200      400

In [44]:
df.add_prefix('X_')

   X_col_one  X_col_two
0        100        300
1        200        400

In [46]:
df

   col_one  col_two
0      100      300
1      200      400

In [48]:
df.add_suffix('_Y')

   col_one_Y  col_two_Y
0        100        300
1        200        400

In [52]:
population_dict = {'Cal': 2342,
                   'Tex': 3424,
                   'NY': 9349,
                   'Flo': 7340,
                   'Ill': 9349}
population = pd.Series(population_dict)
population

Cal    2342
Tex    3424
NY     9349
Flo    7340
Ill    9349
dtype: int64

In [56]:
area_dict = {'Cal': 542,
                   'Tex': 354,
                   'NY': 123,
                   'Flo': 643,
                   'Ill': 768}
area = pd.Series(area_dict)
area

Cal    542
Tex    354
NY     123
Flo    643
Ill    768
dtype: int64

In [60]:
states = pd.DataFrame({'population': population, 'area': area})
states

     population  area
Cal        2342   542
Tex        3424   354
NY         9349   123
Flo        7340   643
Ill        9349   768

In [62]:
data = [{'a': i, 'b':2*i}
        for i in range(3)]
pd.DataFrame(data)

   a  b
0  0  0
1  1  2
2  2  4

In [66]:
dat = [{'a': i, 'b': i*i} for i in range(5)]
dat
pd.DataFrame(dat)

   a   b
0  0   0
1  1   1
2  2   4
3  3   9
4  4  16

In [68]:
pd.DataFrame(np.random.rand(3,2), columns=['foo', 'bar'], index=['a','b','c'])

        foo       bar
a  0.643274  0.255836
b  0.374702  0.272392
c  0.954813  0.087420

In [74]:
ex1= pd.Series([3,2,4,5])
print(ex1)
print(type(ex1))

0    3
1    2
2    4
3    5
dtype: int64
<class 'pandas.core.series.Series'>

In [80]:
print("converting to list: ", ex1.tolist())
print("Type of list: ", type(ex1.tolist()))

converting to list:  [3, 2, 4, 5]
Type of list:  <class 'list'>

In [96]:
ds1= pd.Series([2,4,6,8,10])
ds2 = pd.Series([1,3,5,7,9])
print(ds1)
print(ds2)
add = ds1 + ds2
print("Add: \n", add)
subtract = ds1-ds2
print("Subtract: \n", subtract)
div = ds1/ds2
print("DIv: \n", div)
mul = ds1*ds2
print("Multiplication: \n", mul)

0     2
1     4
2     6
3     8
4    10
dtype: int64
0    1
1    3
2    5
3    7
4    9
dtype: int64
Add:
 0     3
1     7
2    11
3    15
4    19
dtype: int64
Subtract:
 0    1
1    1
2    1
3    1
4    1
dtype: int64
DIv:
 0    2.000000
1    1.333333
2    1.200000
3    1.142857
4    1.111111
dtype: float64
Multiplication:
 0     2
1    12
2    30
3    56
4    90
dtype: int64

In [98]:
ds1 = pd.Series([2,4,6,8,10])
ds2 = pd.Series([1,3,5,7,10])
print("first ds: \n", ds1)
print("second ds: \n", ds2)

first ds:
 0     2
1     4
2     6
3     8
4    10
dtype: int64
second ds:
 0     1
1     3
2     5
3     7
4    10
dtype: int64

In [106]:
print("Comparing the different dataset values")
print("Equals")
print(ds1==ds2)
print("Greater than")
print(ds1>ds2)
print("Less than")
print(ds1<ds2)

Comparing the different dataset values
Equals
0    False
1    False
2    False
3    False
4     True
dtype: bool
Greater than
0     True
1     True
2     True
3     True
4    False
dtype: bool
Less than
0    False
1    False
2    False
3    False
4    False
dtype: bool

In [108]:
dict = {'a':100, 'b':200,'c':300,'d':400,'e':800}
dict

{'a': 100, 'b': 200, 'c': 300, 'd': 400, 'e': 800}

In [110]:
conv_dict = pd.Series(dict)
conv_dict

a    100
b    200
c    300
d    400
e    800
dtype: int64

In [116]:
np_arr = np.array([10,20,30,40,50])
print(np_arr)
type(np_arr)

[10 20 30 40 50]

numpy.ndarray

In [122]:
conv_arr = pd.Series(np_arr)
print("converted numpy array: ", conv_arr)
print("data type \n", type(conv_arr))

converted numpy array:  0    10
1    20
2    30
3    40
4    50
dtype: int64
data type
 <class 'pandas.core.series.Series'>

In [138]:
ds = pd.Series(['100', '200', 'python', '300.12', '400'])
print("initial dataset: ", ds)
print("Changing the dataset: ")
ds1 = pd.to_numeric(ds, errors='coerce')
print(ds1)

#errors has three paramerters
## coerce replates the string as Nan
## raise throws an error
## ignore puts the string as same and ignores it

initial dataset:  0       100
1       200
2    python
3    300.12
4       400
dtype: object
Changing the dataset:
0    100.00
1    200.00
2       NaN
3    300.12
4    400.00
dtype: float64

In [148]:
df = pd.DataFrame([[1,2,3,4],[4,5,6,9],[7,5,8,12]], columns=['col1', 'col2', 'col3', 'col4'])
df

   col1  col2  col3  col4
0     1     2     3     4
1     4     5     6     9
2     7     5     8    12

In [158]:
s1 = df.iloc[:,0]
print(s1)
print(type(s1))
s1.values
#.values converts series to array

0    1
1    4
2    7
Name: col1, dtype: int64
<class 'pandas.core.series.Series'>

array([1, 4, 7])

In [170]:
s = pd.Series([['Red', 'Green', 'White'],['Red', 'black'],['Yellow']])
print(s)
print("stacking the multiple series of list to one series")
s1 = s.apply(pd.Series).stack().reset_index(drop='true')
print(s1)

0    [Red, Green, White]
1           [Red, black]
2               [Yellow]
dtype: object
stacking the multiple series of list to one series
0       Red
1     Green
2     White
3       Red
4     black
5    Yellow
dtype: object

In [176]:
s = pd.Series([[1,2,3],[3,4,5], [4,5]])
print(s)
s1 = s.apply(pd.Series).stack().reset_index(drop='true')
print(s1)

0    [1, 2, 3]
1    [3, 4, 5]
2       [4, 5]
dtype: object
0    1.0
1    2.0
2    3.0
3    3.0
4    4.0
5    5.0
6    4.0
7    5.0
dtype: float64

In [184]:
so = pd.Series(['100', '200', 'python', '200.12','400'])
print(so)
sorted = so.sort_values()
print(sorted)

0       100
1       200
2    python
3    200.12
4       400
dtype: object
0       100
1       200
3    200.12
4       400
2    python
dtype: object

In [196]:
s = pd.Series([3,5,1,2,4,6,2,3,66])
print(s)
asc = s.sort_values()
print("Ascending: \n", asc)
desc = s.sort_values(ascending=False)
print("Descending: \n", desc)

#sort_values is used to sort the values of series in ascending order
#sort_values(ascending=False) is used to sort the values of series in descending order

0     3
1     5
2     1
3     2
4     4
5     6
6     2
7     3
8    66
dtype: int64
Ascending:
 2     1
3     2
6     2
0     3
7     3
4     4
1     5
5     6
8    66
dtype: int64
Descending:
 8    66
5     6
1     5
4     4
0     3
7     3
3     2
6     2
2     1
dtype: int64

In [218]:
s = pd.Series(['100', '200', 'python', '300'])
print("Initial Series: \n", s)
print("New Series: \n", pd.concat([s, pd.Series([500, 'php'])], ignore_index=True))
print("Arranging in ascending order: ", s.sort_values())

Initial Series:
 0       100
1       200
2    python
3       300
dtype: object
New Series:
 0       100
1       200
2    python
3       300
4       500
5       php
dtype: object
Arranging in ascending order:  0       100
1       200
3       300
2    python
dtype: object

In [228]:
s = pd.Series([1,2,3])
print("initial series: \n", s)
s1 = pd.Series([4,5,6])
print("to be added: \n", s1)
s2 = pd.concat([s,s1], ignore_index=True)
print("Final series: \n", s2)
print("Descending order: \n", s2.sort_values(ascending=
                                            False))

initial series:
 0    1
1    2
2    3
dtype: int64
to be added:
 0    4
1    5
2    6
dtype: int64
Final series:
 0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64
Descending order:
 5    6
4    5
3    4
2    3
1    2
0    1
dtype: int64

In [232]:
d1 = pd.Series([1,2,3,4,5], index=['a','b','c','d','e'])
print(d1)
d2 = d1.reindex(['b','a','c','d','e'])
print(d2)

a    1
b    2
c    3
d    4
e    5
dtype: int64
b    2
a    1
c    3
d    4
e    5
dtype: int64

In [234]:
s = pd.Series([1,2,3,4,5,6,7,8,9,5,3])
print(s)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9     5
10    3
dtype: int64

In [236]:
print("Mean of the dataset: ", s.mean())
print("Standard Deviation of the dataset: ", s.std())

Mean of the dataset:  4.818181818181818
Standard Deviation of the dataset:  2.522624895547565

In [238]:
s1 = pd.Series([1,2,3,4,5])
s2 = pd.Series([2,4,6,7,10])
print(s1)
print(s2)

0    1
1    2
2    3
3    4
4    5
dtype: int64
0     2
1     4
2     6
3     7
4    10
dtype: int64

In [244]:
only_s1 = s1[~s1.isin(s2)]
print(only_s1)

0    1
2    3
4    5
dtype: int64

In [246]:
only_s2 = s2[~s2.isin(s1)]
print(only_s2)

2     6
3     7
4    10
dtype: int64

In [248]:
# done upto question number 16
## https://www.w3resource.com/python-exercises/pandas/index-data-series.php